# Exercise 4.5

### Contents

1. Data Consistency Checks on df.prods
	
	a. Missing Values
	
	b.Duplicates


2. Data Consistency Checks on df.ords

	a. Mixed Data Types

	b. Missing Values

	c. Duplicates

## Importing Libraries and Data

In [6]:
# importing libraries
import pandas as pd
import numpy as np
import os

In [7]:
#importing data using path shortcut - both csvs
path1 = r'/Users/elysegross/Documents/Data Analytics/A4 - Instacart Basket Analysis/'
df_ords = pd.read_csv(os.path.join(path1, '02 Data', 'Prepared Data', 'orders_wrangled.csv'))
df_prods = pd.read_csv(os.path.join(path1, '02 Data', 'Original Data', 'products.csv'))

# Step 1. Data Consistency Checks on df.prods

In [8]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

## Missing Values

In [9]:
#Counting missing values in each column
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

### Finding Missing Values

In [10]:
#To view missing values create a subset of the dataframe
df_nan = df_prods[df_prods['product_name'].isnull() == True]
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

### Addressing Missing Values

In [11]:
#See number of rows before removing anything
df_prods.shape

(49693, 5)

In [12]:
#Create new dataframe
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [13]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

## Duplicates

### Finding Duplicates

In [14]:
#Looking for full duplicates - rows with exact same values
df_dups = df_prods[df_prods.duplicated()]

In [15]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [16]:
#The code above located the duplicate rows

### Addressing Duplicates

In [17]:
#Viewing row count for original dataframe
df_prods.shape

(49693, 5)

In [18]:
#Removing dupes from df_prods_clean
df_prods_clean_no_dupes = df_prods.drop_duplicates()

In [19]:
df_prods_clean_no_dupes

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [20]:
#Counting rows for new dataframe w/o duplicates
df_prods_clean_no_dupes.shape

(49688, 5)

# Data Consistency Checks on df.ords for task

# Step 2.

In [21]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

Some things that are interesting are that these are id numbers but they are included in the describe. This does not make much sense since they are not really numeric. Additionally, the max price is crazy high, I cannot imagine it is really 99999.

# Step 3. Checking for mixed-type data

In [22]:
#Checking for any mixed column names

for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

There are no mixed-type data in this dataframe

# Step 4. N/A

# Step 5. Check for missing values

In [23]:
#Counting missing values in each column
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour                     0
days_since_prior_order    206209
dtype: int64

In [24]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [25]:
#Filling missing values with the mean
df_ords['days_since_prior_order'].fillna(1.111484e+01, inplace=True)

In [26]:
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour,days_since_prior_order
0,0,2539329,1,1,2,8,11.11484
1,1,2398795,1,2,3,7,15.00000
2,2,473747,1,3,3,12,21.00000
3,3,2254736,1,4,4,7,29.00000
4,4,431534,1,5,4,15,28.00000

## Step 6.

I decided to fill the missing values in with 'No previous order' because it felt the most applicable to days since last order. Putting in the mean would not make since because there had not been a previous order on these so it is best to just write 'No previous order' where this column is missing values.

## Step 7.

In [27]:
#Looking for full duplicates - rows with exact same values
df_dupes_ords = df_ords[df_ords.duplicated()]

In [28]:
#This located the duplicate rows
df_dupes_ords

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour, days_since_prior_order]
Index: []

## Step 8.

In [29]:
df_ords.shape

(3421083, 7)

In [30]:
#Removing dupes from df_ords
df_ords_clean_no_dupes = df_ords.drop_duplicates()

In [31]:
df_ords_clean_no_dupes.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour,days_since_prior_order
0,0,2539329,1,1,2,8,11.11484
1,1,2398795,1,2,3,7,15.00000
2,2,473747,1,3,3,12,21.00000
3,3,2254736,1,4,4,7,29.00000
4,4,431534,1,5,4,15,28.00000

In [32]:
#Counting rows for new dataframe w/o duplicates
df_prods_clean_no_dupes.shape

(49688, 5)

## Step 9. Exporting Data

In [33]:
#Exporting df_ords
df_ords_clean_no_dupes.to_csv(os.path.join(path1, '02 Data','Prepared Data', 'orders_cleaned.csv'))
#Exporting df_dep
df_prods_clean_no_dupes.to_csv(os.path.join(path1, '02 Data','Prepared Data', 'products_cleaned.csv'))

# THE END!